Sandgreenpanda/2026-ESP32/src/main.cpp
#include "HardwareSerial.h"
#include "esp32-hal-ledc.h"
#include "esp32-hal.h"
#include <HTTPRequest.hpp>
#include <HTTPResponse.hpp>
#include <HTTPSServer.hpp>
#include <SSLCert.hpp>
#include <WiFi.h>
#include <WiFiMulti.h>
#include <functional>
#include <libssh/libssh.h>
#include <sha/sha_parallel_engine.h>
#include <ssh_functions.h>

#include <lwip/sockets.h>

#include <FS.h>
#include <SD.h>
#include <SPI.h>
#define SD_MISO 16
#define SD_SCK 17
#define SD_MOSI 18
#define SD_CS 19

#define LAPTOP_HP_1 33
#define LAPTOP_HP_2 32
#define LAPTOP_HP_3 12
#define LAPTOP_LENOVO_1 27
#define LAPTOP_ACER_1 26
#define LAPTOP_ACER_2 25

#define PWM_FAN_1 23
#define TACH_FAN_1 22

// Max ssh clients. So fat this is for ne computer, so I may do different objs later.
// For now four is more than enough
#define MAX_CLIENTS 4

// Spi for the sd card file system
SPIClass sdSPI(VSPI);

// The HTTPS Server comes in a separate namespace. For easier use, include it here.
using namespace httpsserver;

WiFiMulti wifiMulti;

// Fan settings
const int PWM_FREQ = 25000; // 25 kHz frequency for computer fans
const int PWM_RESOLUTION = 8;
volatile unsigned long tachPulseCount = 0;
unsigned long lastTachTime = 0;
const unsigned long TACH_SAMPLE_TIME = 1000; // Sample period in milliseconds

// Interrupt service routine for tachometer
void IRAM_ATTR tachISR() {
    tachPulseCount = tachPulseCount + 1;
}

SSLCert *cert;
HTTPSServer *secureServer;

// Declare some handler functions for the various URLs on the server
void handleRoot(HTTPRequest *req, HTTPResponse *res);
void handle404(HTTPRequest *req, HTTPResponse *res);
void handleTerminal(HTTPRequest *req, HTTPResponse *res);
void handleTerminalPost(HTTPRequest *req, HTTPResponse *res);
void handleToggle1(HTTPRequest *req, HTTPResponse *res);
void handleToggle2(HTTPRequest *req, HTTPResponse *res);
void handleToggle3(HTTPRequest *req, HTTPResponse *res);
void handleToggle4(HTTPRequest *req, HTTPResponse *res);
void handleToggle5(HTTPRequest *req, HTTPResponse *res);
void handleToggle6(HTTPRequest *req, HTTPResponse *res);
void handleFan(HTTPRequest *req, HTTPResponse *res);
void handleStyle(HTTPRequest *req, HTTPResponse *res);
void handleTerminalUpdate(HTTPRequest *req, HTTPResponse *res);
void handleComputers(HTTPRequest *req, HTTPResponse *res);
void handleAdmin(HTTPRequest *req, HTTPResponse *res);
void handleLogIn(HTTPRequest *req, HTTPResponse *res);
void handleSSHpage(HTTPRequest *req, HTTPResponse *res);

void middlewareAuth(HTTPRequest *req, HTTPResponse *res, std::function<void()> next);

// List of clients that signed up for sse
std::vector<httpsserver::HTTPResponse *> sseClients;
// std::vector<int> sseClients;

const unsigned int configSTACK = 51200;

volatile devState_t devState;
volatile bool gotIpAddr, gotIp6Addr;
volatile bool wifiPhyConnected;

String ssh_command = "";
String shh_output_string = "";
String shh_output_send_temp_old = "";

String shh_output_send = "";
String shh_output_send_temp = "";

String PASSWORD = "OYW7]X}7:)[Z2T;l58-P6(P6+{21t0tF"; // This is NOT my password.
// This is a fallback for if the sd card does not load
// There is no way to not commit the fallback to github, by nature of it being a fallback
// I can't initialise it as an empty string, because in the case the SD card does not load,
// an empty string is not secure.

// SSH handler class
class SSHHandler : public WebsocketHandler {
  public:
    // This method is called by the webserver to instantiate a new handler for each
    // client that connects to the websocket endpoint
    static WebsocketHandler *create();

    // This method is called when a message arrives
    void onMessage(WebsocketInputStreambuf *input);

    // Handler function on connection close
    void onClose();
};

// Simple array to store the active clients:
SSHHandler *activeClients[MAX_CLIENTS];

int ex_main() {
    Serial.println("Exec main begin");
    ssh_session session = NULL;
    ssh_channel channel = NULL;
    char buffer[256];
    int rbytes;
    int rc;

    int nbytes;
    int nwritten;

    int writeBufferSize;

    int lastHandleKeepAlive = millis();

    // Temporarily using test server
    // session = connect_ssh("Home1918", "10.47.1.39", "alext", 0);
    // session = connect_ssh("Home1918", "192.168.1.222", "alext", 0);
    session = connect_ssh("password", "test.rebex.net", "demo", 0);

    if (session == NULL) {
        ssh_finalize();
        return 1;
    }

    channel = ssh_channel_new(session);

    rc = ssh_channel_open_session(channel);
    if (rc != SSH_OK) {
        Serial.println("Open Fail");
        goto failed;
    }

    rc = ssh_channel_request_pty(channel);
    if (rc != SSH_OK) {
        Serial.println("Request Fail");
        goto failed;
    }
    rc = ssh_channel_change_pty_size(channel, 100, 30);
    if (rc != SSH_OK) {
        Serial.println("Resize Fail");
        goto failed;
    }
    rc = ssh_channel_request_shell(channel);
    if (rc != SSH_OK) {
        goto failed;
        Serial.println("Shell Fail");
    }
    Serial.println("loop begin");
    while (1) {
        // nbytes = ssh_channel_read_nonblocking(channel, buffer, sizeof(buffer), 0);
        //   nbytes = ssh_channel_read_nonblocking(channel, buffer, sizeof(buffer), 0);

        // if (nbytes > 0) {
        //    shh_output_string = String(buffer, nbytes);
        //   Serial.println(shh_output_string);
        // }

        // This read is temp commented out
        shh_output_send_temp = "";
        rbytes = ssh_channel_read_nonblocking(channel, buffer, sizeof(buffer), 0);

      

        while (rbytes > 0) {
            // Serial.println("response loop");
            shh_output_send_temp += String(buffer, rbytes);
            rbytes = ssh_channel_read_nonblocking(channel, buffer, sizeof(buffer), 0);
            // Serial.println(rbytes);
        }

        if (shh_output_send_temp != "") {

            Serial.println(shh_output_send_temp);

            //shh_output_send_temp_old = shh_output_send_temp;

            for (int i = 0; i < MAX_CLIENTS; i++) {
                if (activeClients[i] != nullptr) {
                    Serial.print("THIS +");
                    Serial.println(shh_output_send_temp.c_str());
                    activeClients[i]->send(shh_output_send_temp.c_str(), WebsocketHandler::SEND_TYPE_TEXT);
                }
            }
        }

        // shh_output_send = shh_output_send_temp; // Sends the data for processing

