Sandgreenpanda/2026-ESP32/src/main.cpp
        // This loop goes though ever client and attempts to update it with the new ssh data
        // If the client does not respond it is assumed disconnected and is removed
        // Commented out because SSE is deprecated, use websockets
        /*
        for (auto client = sseClients.begin(); client != sseClients.end();) { // Note there is no auto increment, this is done manually
            size_t bytesWritten = (*client)->print(shh_output_send_temp);
            // int bytesWritten = lwip_send((*client), shh_output_send_temp.c_str(), shh_output_send_temp.length(), MSG_DONTWAIT);

            if (bytesWritten <= 0 && shh_output_send_temp != "") { // Less than 0 is error code, and 0 is no bytes written.
                                                                   // We also make sure we actually were writing bytes to prevent false positives

                // Removes the item, as the client has disconnected. Sets the iterator to the next valid client
                delete *client;
                client = sseClients.erase(client);
            } else {
                client++;
            }
        }
        */

        if (ssh_command != "") {
            Serial.println("ssh cmd received");
            Serial.println(ssh_command);
            // channel = ssh_channel_new(session);

            // Better ssh start:

            // Put the command bytes the format ssh write wants

            ssh_command += "\n";

            ssh_channel_write(channel, ssh_command.c_str(), ssh_command.length());

            /*

            rc = ssh_channel_open_session(channel);
            //if (rc < 0) {
            //    goto failed;
            //}
            rc = ssh_channel_request_exec(channel, ssh_command.c_str());
            // if (rc < 0) {
            //     goto failed;
            //  }
            Serial.println(rc);
            // Reads the ssh output
            shh_output_string = "";
            rbytes = ssh_channel_read(channel, buffer, sizeof(buffer), 0);
            Serial.println("response 1");


            */

            // Prints the ssh output
            //  Serial.println(shh_output_string);
            //   shh_output_string = "";
            /*
            rbytes = ssh_channel_read_nonblocking(channel, buffer, sizeof(buffer), 0);

            if (rbytes > 0) {
                shh_output_string = String(buffer, rbytes);
            }
            do {
                Serial.println("response loop");
                shh_output_string += String(buffer, rbytes);
                rbytes = ssh_channel_read_nonblocking(channel, buffer, sizeof(buffer), 0);
                Serial.println(rbytes);
            } while (rbytes > 0);

            Serial.println(shh_output_string);
            */

            ssh_command = ""; // Reset command to prevent infinite loop

            //  ssh_channel_send_eof(channel);
            // ssh_channel_close(channel);
            // ssh_channel_free(channel);
            Serial.println("ssh command processing finished");
        } else {
            if (millis() - lastHandleKeepAlive >= 10000) { // Every 10 seconds
                Serial.println("Keep Alive Check");
                ssh_send_ignore(session, "keepalive");
                lastHandleKeepAlive = millis();
            }
        }
        vTaskDelay(1 / portTICK_PERIOD_MS);
    }

    ssh_disconnect(session);
    ssh_free(session);
    ssh_finalize();
    return 0;
failed:
    Serial.println("FAIL");
    ssh_channel_close(channel);
    ssh_channel_free(channel);
    ssh_disconnect(session);
    ssh_free(session);
    ssh_finalize();
    return 1;
}

void controlTask(void *pvParameter) {
    wifiMulti.run();
    Serial.println("Wifi run finished");
    wait_for_wifi_exec(ex_main);
}

void setup() {

    digitalWrite(LAPTOP_HP_1, LOW);
    digitalWrite(LAPTOP_HP_2, LOW);
    digitalWrite(LAPTOP_HP_3, LOW);
    digitalWrite(LAPTOP_LENOVO_1, LOW);
    digitalWrite(LAPTOP_ACER_1, LOW);
    digitalWrite(LAPTOP_ACER_2, LOW);
    pinMode(LAPTOP_HP_1, OUTPUT);
    pinMode(LAPTOP_HP_2, OUTPUT);
    pinMode(LAPTOP_HP_3, OUTPUT);
    pinMode(LAPTOP_LENOVO_1, OUTPUT);
    pinMode(LAPTOP_ACER_1, OUTPUT);
    pinMode(LAPTOP_ACER_2, OUTPUT);

    // Setup fans
    // First pin is declared to use chanel 0
    ledcSetup(0, PWM_FREQ, PWM_RESOLUTION);
    ledcAttachPin(PWM_FAN_1, 0);
    ledcWrite(0, 0); // Set initial fan speed to zero

    // Configure tachometer pin with interrupt
    pinMode(TACH_FAN_1, INPUT_PULLUP);
    attachInterrupt(digitalPinToInterrupt(TACH_FAN_1), tachISR, FALLING);

    // Initialize timing for fan tach
    lastTachTime = millis();

    WiFi.disconnect(true);

    // Max wifi strength
    // WiFi.setTxPower(WIFI_POWER_19_5dBm);
    WiFi.setSleep(false);

    wifiMulti.addAP("WC Devices", "0jebr9yrxh");
    wifiMulti.addAP("SPARK-UMRK2N", "NKUWEW7ZZV");

    // ESP32 is 2.4GHZ only
    // wifiMulti.addAP("SPARK-UMRK2N-5G", "NKUWEW7ZZV");

    devState = STATE_NEW;

    Serial.begin(115200);

    Serial.println("Creating a new self-signed certificate.");
    Serial.println("This may take up to a minute, so be patient ;-)");

    cert = new SSLCert();

    int createCertResult = createSelfSignedCert(
        *cert,
        KEYSIZE_1024,
        "CN=10.47.6.92,O=Sandgreenpanda,C=DE",
        "20190101000000",
        "20300101000000");

    // Now check if creating that worked
    if (createCertResult != 0) {
        Serial.printf("Cerating certificate failed. Error Code = 0x%02X, check SSLCert.hpp for details", createCertResult);
        while (true)
            delay(500);
    }
    Serial.println("Creating the certificate was successful");

    sdSPI.begin(SD_SCK, SD_MISO, SD_MOSI, SD_CS);
    if (!SD.begin(SD_CS, sdSPI)) {
        Serial.println("SD mount failed");
    } else {
        Serial.println("SD mount successful");
    }

    // Real password is initialed from the SD
    PASSWORD = SD.open("/crypto/password.txt", FILE_READ).readString();

    // Initialise the custom wifi event handler, which allows wait_for_wifi_exec to know when the ipv4 and v6 addresses have been set.
    esp_netif_init();
    esp_event_loop_create_default();
    esp_event_handler_instance_register(WIFI_EVENT, ESP_EVENT_ANY_ID, event_cb, NULL, NULL);
    esp_event_handler_instance_register(IP_EVENT, ESP_EVENT_ANY_ID, event_cb, NULL, NULL);

    // Stack size needs to be larger, so continue in a new task.

    xTaskCreatePinnedToCore(controlTask, "ctl", configSTACK, NULL, (tskIDLE_PRIORITY + 3), NULL, portNUM_PROCESSORS - 1);

    secureServer = new HTTPSServer(cert);

    ResourceNode *nodeRoot = new ResourceNode("/", "GET", &handleRoot);
    ResourceNode *node404 = new ResourceNode("", "GET", &handle404);
    ResourceNode *nodeTerminal = new ResourceNode("/terminal", "GET", &handleTerminal);
    ResourceNode *nodeTerminalPost = new ResourceNode("/terminal_post", "POST", &handleTerminalPost);
    ResourceNode *nodeToggle1 = new ResourceNode("/toggle1", "POST", &handleToggle1);
    ResourceNode *nodeToggle2 = new ResourceNode("/toggle2", "POST", &handleToggle2);
    ResourceNode *nodeToggle3 = new ResourceNode("/toggle3", "POST", &handleToggle3);
    ResourceNode *nodeToggle4 = new ResourceNode("/toggle4", "POST", &handleToggle4);
    ResourceNode *nodeToggle5 = new ResourceNode("/toggle5", "POST", &handleToggle5);
    ResourceNode *nodeToggle6 = new ResourceNode("/toggle6", "POST", &handleToggle6);
    ResourceNode *nodeAdmin = new ResourceNode("/admin", "GET", &handleAdmin);
    ResourceNode *nodeLogIn = new ResourceNode("/admin", "POST", &handleLogIn);

    ResourceNode *nodeHandleFan = new ResourceNode("/fan", "POST", &handleFan);
    ResourceNode *nodeHandleStyle = new ResourceNode("/style.css", "GET", &handleStyle);
    ResourceNode *nodeHandleComputers = new ResourceNode("/computers", "GET", &handleComputers);

    ResourceNode *nodeHandleTerminalUpdate = new ResourceNode("/update", "GET", &handleTerminalUpdate);
    ResourceNode *nodehandleSSHpage = new ResourceNode("/sshpage", "GET", &handleSSHpage);
    WebsocketNode *sshNode = new WebsocketNode("/ssh", &SSHHandler::create);

